Case_n0_25/Case_a0/Case_lc0_025/0/porosity
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      porosity;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
12480
(
1
1
1
1
1
1
1
1
...
)
;

boundaryField
{
    sides
    {
        type            empty;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
480
(
1
1
1
1
1
1
1
1
...
)
;
    }
    rightWall
    {
        type            calculated;
        value           uniform 1;
    }
    atmosphere
    {
        type            calculated;
        value           uniform 1;
    }
    inlet
    {
        type            calculated;
        value           uniform 1;
    }
}


// ************************************************************************* //
